[
{"title": ["Computing project sends “open source ambassadors” to GitHub"], "description": ["\n      ", "Project maintainers on the cloud coding site GitHub may have noticed a recent surge in “open source ambassadors” from The Australian National University (ANU).", "\n\n", "More than 300 bugs were fixed in a week’s time by 53 teams made up of 260 students who blitzed their way into GitHub to fix bugs and propose new features for open-source software as part of a course called ", "Software Engineering (COMP2120/6120)", ".", "\n\n", "The class is taught by ", "Associate Professor Alex Potanin", ", who is teaching his first course at ANU after arriving in June. Associate Professor Potanin said that he completely redesigned the course “to emphasise open source and its importance in the modern microservices-oriented development approaches”.", "\n\n", "\nANU student Amelia Genova, whose team of five decided to identify and fix issues in the code for JavaParser, said, “it was an interesting experience to see how to contribute to an open-source project”.", "\n\n", "Genova said it was more fun to work and learn about computing “out in the industry and beyond the academic setting”.", "\n\n", "Her teammate Jacob Weston-Davis agreed. Compared to his previous group projects, he said, “ I definitely felt a lot more responsibility and pressure to make sure the code I was submitting was well-written and documented properly”. ", "\n\n", "“The idea of not wanting to waste the maintainer’s time was core to me in how I approached the assignment,” Weston-Davis said.", "\n\n", "The ANU School of Computing’s teaching philosophy is to begin with computing foundations and build up to the coding languages, applications, and industry tools that are relevant in a rapidly evolving industry.  ", "\n\n", "“This is the course where our students learn large scale programming,” said Associate Professor Potanin. “They know how to program on the small scale, but if we just throw you into a large company, the planes will start crashing because you don’t know how things work. So, we teach them the techniques and knowledge required for working in a large company.”", "\n\n", "With marks for the students’ optimised coding dependent on acceptance and integration in real-world software packages, Potanin has gone a step beyond bringing current industry tools into the academy; he’s intertwined them.", "\n\n", "Virtual apprenticeship starts with a request", "\n\n", "\nThe process begins with a “pull request” by which the students offer to address an issue that tech purveyors have listed as in need of addressing. The students could also make suggestions for other improvements not yet envisioned.", "\n\n", "If the pull request is accepted, a virtual apprenticeship begins in which the purveyor shares a portion of the code with the students, the students enhance it, and then submit it back to the purveyor.  ", "\n\n", "The goal of GitHub users and purpose of the site is to have these fixes accepted by the purveyors and merged back into the code as a permanent fix. With over 300 instances of successful pull requests, the ANU students and their instructor are feeling encouraged and ready for more.", "\n\n", "Associate Professor Potanin estimates that 1/3 of his students already had GitHub profiles before the course (his guess would be higher if not for restrictions faced by students located in some countries). Now they all have profiles on which they can build. ", "\n\n", "\n\n", "They often introduced themselves as ANU students, although they were not instructed to do so. With such a high volume of pull requests resulting in successful collaborations around the globe, Associate Professor Potanin sees his students as “open source ambassadors” reflecting positively on Australia and the ANU. ", "\n\n", "Budding coders typically gain experience and burnish their credentials by amassing “code accepted” outcomes on their GitHub profiles. ", "\n\n", "“When they look for jobs they will be able to say, ‘look at that issue on GitHub, I have contributed to it. Here are my development activities’. It’s very public,” he said.", "\n\n", "Does that mean people living in their parents’ basement with no formal training can get job offers by exceling on GitHub?", "\n\n", "Yes, Associate Professor Potanin says, it happens, and employment oppotunities might also arise here, but the primary purpose of the course is to allow students to learn how to contribute in a small way to a large project. This will have applications far beyond the open-source, virtual collaboration available on GitHub.", "\n\n", "Teamwork, coding and attention to detail", "\n\n", "Genova and Weston-Davis’ team had chosen JavaParser because they had familiarity with the Java coding language, but found the majority of the process was learning and understanding the codebase.", "\n\n", "The team members reviewed each other’s work and, in this process, helped each other gain a better understanding of the codebase. They split into teams of one or two for each issue, but when a problem or barrier arose, “the whole team would come together to try to resolve it”, Genova said.", "\n\n", "Potanin said the other 52 teams had similar experiences.", "\n\n", "“They helped each other because addressing different bugs within the same system requires knowledge of the system across the team.”", "\n\n", "\nA handful of teams found that by the time they submitted the amended code, someone else had beat them to it.  ", "\n\n", "“We realise that somebody else in the world may be fixing the same bug,” said Associate Professor Potanin. “We don’t penalise them for that because this is an educational environment.”", "\n\n", "If the students show that they have fixed the bug, they get full credit.", "\n\n", "Some examples of successful pull requests by student teams include:", "\n\n", "\n  ", "Contribution accepted into an Android streaming app", "\n  ", "Contribution accepted into a Reddit reader app", "\n  ", "One of several non-trivial ", "contributions accepted into an advanced modern debugging tool", " used by many developers", "\n  ", "Auto-linking files with safe character replacements", "\n", "\n\n", "COMP2120 is the course number for the undergraduate version of ", "Software Engineering", ". Graduate students take COMP6120 and attending the same lectures, the primary difference being they are required to write additional research essays.", "\n\n\n      \n      \n        \n\n\n\n\n\n  ", "\n    \n      \n      \n        ", "Newer", "\n      \n      \n        ", "Older", "\n      \n    \n  ", "\n\n\n      \n    "], "date": ["Project maintainers on the cloud coding site GitHub may have noticed a recent surge in “open source ambassadors” from The Australian National University (ANU)."], "venue": ["More than 300 bugs were fixed in a week’s time by 53 teams made up of 260 students who blitzed their way into GitHub to fix bugs and propose new features for open-source software as part of a course called ", "."]},
{"title": ["Making the Invisible Visible—Observing Complex Software Dynamics"], "description": ["\n      ", "Time: 11:30am-12:30pm, Monday 17 July 2023", "\n\n", "Location: Innovation Space, Level 2, ", "Birch Building 35", "\n\n", "Abstract", "\n\n", "From mobile and cloud apps to video games to driverless vehicle control, more and more software is time-constrained: it must deliver reliable results seamlessly, consistently, and virtually instantaneously. If it doesn’t, customers are unhappy–and sometimes lives are put at risk. When complex software underperforms or fails, identifying the root causes is difficult and, historically, few tools have been available to help, leaving application developers to guess what might be happening. How can we do better?", "\n", "\nThe key is to have low-overhead observation tools that can show exactly where all the  elapsed time goes in both normal responses and in delayed responses. Doing so makes visible each of the seven possible reasons for such delays, as we show.", "\n\n", "Biography", "\n\n", "Richard L. Sites wrote his first computer program in 1959 and has spent most of his career at the boundary between hardware and software, with a particular interest in CPU/software performance interactions. His past work includes VAX microcode, DEC Alpha co-architect, and inventing the performance counters found in nearly all processors today. He has done low-overhead microcode and software tracing at DEC, Adobe, Google, and Tesla. Dr. Sites earned his PhD at Stanford in 1974; he holds 66 patents and is a member of the US National Academy of Engineering.", "\n\n\n      \n      \n        \n\n\n\n\n\n  ", "\n    \n      \n      \n        ", "Newer", "\n      \n      \n        ", "Older", "\n      \n    \n  ", "\n\n\n      \n    "], "date": ["Time: 11:30am-12:30pm, Monday 17 July 2023"], "venue": ["Location: Innovation Space, Level 2, "]},
{"title": ["Analyzing Models, Code and Training Processes for Deep Learning Assurance "], "description": ["\n      ", "Time: 2-3pm, Monday 22 May 2023", "\n\n", "Location: Innovation Space, Level 2, ", "Birch Building 35", "\n\n", "Abstract", "\n\n", "My research focuses on understanding and assuring deep learning to ensure models can be reliably and securely deployed in the real world. In this talk, I will first discuss what deep learning assurance is and our plans for analyzing models, code and training processes to achieve the goal of assurance. I will highlight three results of our recent work: (1) empirical studies and analysis of state-of-the-art deep learning models for vulnerability detection and security; (2) dynamic analysis of training processes for early detection of malfunctioned models; and (3) numerical stability challenges in deep learning and how they may be addressed.", "\n\n", "Biography", "\n\n", "Wei Le is an associate professor at Iowa State University. Her research lies in the intersection of program analysis, software engineering and machine learning. Her work has appeared at top-tier venues including ICSE, FSE, ICML, ASE, ISSTA, TOSEM and TSE. She is a recipient of an NSF career award, a Google Research Award and the distinguished paper award at the top software engineering conference FSE.", "\n\n\n      \n      \n        \n\n\n\n\n\n  ", "\n    \n      \n      \n        ", "Newer", "\n      \n      \n        ", "Older", "\n      \n    \n  ", "\n\n\n      \n    "], "date": ["Time: 2-3pm, Monday 22 May 2023"], "venue": ["Location: Innovation Space, Level 2, "]},
{"title": ["Dealing with Discordance in the Tree of Life"], "description": ["\n      ", "Time: 9:30am-10:30am, Thursday 29 June 2023", "\n\n", "Location: Innovation Space, Level 2, ", "Birch Building 35", "\n\n", "Abstract", "\n\n", "Phylogenetics is concerned with uncovering the relationships among organisms (the “Tree of Life”), and computational research has made many important contributions to achieving this goal. In this talk I discuss a major overall challenge facing the field as DNA sequencing efforts have become central to this work: many individual genes have tree topologies that do not match the tree describing relationships among species. Such gene-tree discordance poses many new difficulties for inferring the Tree of Life. Here, I present three approaches for dealing with discordance: 1) a deep-learning method for inferring gene-tree topologies; 2) a quartet summary approach that combines many different gene-tree topologies to construct an accurate species tree, even in the presence of duplication and loss; and 3) a probabilistic approach to reconstructing the history of different traits on a species tree in the presence of discordance. These three problems (and their solutions) represent just a fraction of the challenges now facing the field of phylogenetics.", "\n\n", "Biography", "\n\n", "Matthew Hahn earned his B.S. degree from Cornell University and obtained his Ph.D. from Duke University with Mark Rausher. He was a postdoctoral fellow at the University of California, Davis with Charles Langley and John Gillespie. He is currently a Distinguished Professor of Biology and Computer Science at Indiana University, where he has held a faculty position since 2005. He also directs IU’s Center for Genomics and Bioinformatics.", "\n\n", "His research focuses on how evolution has shaped organismal and genomic diversity, and how adaptation is achieved using multiple different types of molecular changes. His lab couples empirical studies of genome sequences with the development of mathematical theory, new statistical models, and the implementation of open-source software. His work introduced the first methods for quantifying and understanding gene gain and loss among species, applying them to primates to understand the differences between humans and our closest relatives. More recent methods developed by his lab have uncovered both the genes and the traits shared between species due to hybridization.", "\n\n", "He has published over 175 scientific articles and two books, which have collectively been cited more than 29,000 times. His research program has been supported by the U.S. National Science Foundation and National Institutes of Health. He has been the recipient of an NSF CAREER Award, a fellowship from the Alfred P. Sloan Foundation, the Margaret Dayhoff Award from the Society for Molecular Biology and Evolution, the Stebbins Medal from the International Association for Plant Taxonomy, and the Bicentennial Medal from Indiana University. He is an elected fellow of the American Association for the Advancement of Science.", "\n\n\n      \n      \n        \n\n\n\n\n\n  ", "\n    \n      \n      \n        ", "Newer", "\n      \n      \n        ", "Older", "\n      \n    \n  ", "\n\n\n      \n    "], "date": ["Time: 9:30am-10:30am, Thursday 29 June 2023"], "venue": ["Location: Innovation Space, Level 2, "]},
{"title": ["AI, ML & Friends seminar"], "description": ["\n      ", "Speaker:", " Dr. Scott Sanner", "\n\n", "Abstract:", " In this talk I will begin by discussing the need for personalized recommendation in conversational AI assistants and the fundamental challenges that make this problem difficult – both in general and in existing conversational AI architectures. I will next discuss some initial progress my research group has made in addressing these challenges as well as our attempt to understand the broader scope of possible interactions in natural, context-driven conversational recommendation. I will conclude with a summary of potential directions forward in the near-term leveraging recent revolutionary advances in language models such as ChatGPT along with longer-term challenges to overcome in order to fully achieve natural and personalized conversational recommendation interactions.", "\n\n", "Bio:", " Scott Sanner is an Associate Professor in Industrial Engineering and Cross-appointed in Computer Science at the University of Toronto. Scott earned a PhD in Computer Science from the University of Toronto (2008), an MS in Computer Science from Stanford University (2002), and a double BS in Computer Science and Electrical and Computer Engineering from Carnegie Mellon University (1999). Scott’s research focuses on a broad range of AI topics spanning sequential decision-making, (conversational) recommender systems, and applications of machine/deep learning. Scott is currently an Associate Editor for ACM Transactions on Recommender Systems (TORS), the Machine Learning Journal (MLJ), and the Journal of Artificial Intelligence Research (JAIR). Scott was a co-recipient of paper awards from the AI Journal (2014), Transport Research Board (2016), CPAIOR (2018) and a recipient of a Google Faculty Research Award (2020).", "\n\n", "Where:", " Building 145, Room 1.33", "\n\n\n      \n      \n        \n\n\n\n\n\n  ", "\n    \n      \n      \n        ", "Newer", "\n      \n      \n        ", "Older", "\n      \n    \n  ", "\n\n\n      \n    "], "date": [" Dr. Scott Sanner"], "venue": [" In this talk I will begin by discussing the need for personalized recommendation in conversational AI assistants and the fundamental challenges that make this problem difficult – both in general and in existing conversational AI architectures. I will next discuss some initial progress my research group has made in addressing these challenges as well as our attempt to understand the broader scope of possible interactions in natural, context-driven conversational recommendation. I will conclude with a summary of potential directions forward in the near-term leveraging recent revolutionary advances in language models such as ChatGPT along with longer-term challenges to overcome in order to fully achieve natural and personalized conversational recommendation interactions."]},
{"title": ["Hanna Kurniawati to spearhead Autonomous Systems Research in Australia’s space tech"], "description": ["\n      ", "Congratulations to The Australian National University (ANU) expert Professor Hanna Kurniawati, who has been appointed as the ", "SmartSat CRC", " Professorial Chair for System Autonomy, Intelligence, and Decision Making.", "\n\n", "SmartSat is Australia’s leading space research centre – where a team of Australia’s top researchers come together to spearhead the development of next generation space technologies.", "\n\n", "“I am grateful and excited for this opportunity. Space technologies are entering a new era that will become increasingly important to our daily lives, and being in the Southern hemisphere, Australia has a geographical advantage in this domain,” she said.", "\n\n", "Professor Kurniawati is based in the ANU School of Computing, and has significant experience in robotics, planning under uncertainty, robot motion planning, reinforcement learning, and integrated  planning and learning.", "\n\n", "She has spent much of her career researching ways to develop decision-making technologies that would enable robots to operate more reliably and more robustly in cluttered and confined remote environments, as well as in crowded urban environments.", "\n\n", "“Specifically, I focus on computational methods and representations to enable robust decision theory to become practical software tools, with applications in robotics,” she says.", "\n\n", "“Such software tools will enable robots to design their own strategies, such as deciding what data to use, how to gather the data, and how to move, for accomplishing various tasks well, despite various modelling errors and types of uncertainty, and despite limited to no information about the system and its operating environment.”", "\n\n", "The SmartSat CRC consortium has been funded by the Australian Government to develop know-how and technologies in advanced telecommunications and IoT connectivity, intelligent satellite systems and Earth observation next generation data services. Kurniawati will join an experienced ", "SmartSat team", ", including fellow ANU expert Professor Kirk McKenzie who is the Professorial Chair of Precision Measurement in Space.", "\n\n", "We can’t wait to see what Hanna brings to this exciting new role!", "\n\n", "Research that stands the ‘Test of Time’", "\n\n", "\nKurniawati’s work has received multiple recognitions and awards for its national and global impact.", "\n\n", "In 2008, Kurniawati had her work on how to get robots to behave well published in ", "Robotics: Science and Systems IV", " with co-authors from the National University of Singapore (NUS).", "\n\n", "“We developed an effective algorithm to help the robot make the best possible decisions when faced with a number of puzzling scenarios while also being able to understand the consequences of its decisions,” she says.", "\n\n", "In doing so, their algorithm overcame a barrier that had hampered robust decision making for more than four decades due to high computational complexity.", "\n\n", "Their foundational work has been expanded and adopted to instruct robots how to move objects, to study aircraft collision avoidance tech in planes and pedestrian avoidance features in self-driving cars.", "\n\n", "“Our 2008 work was really just the tip of the iceberg in terms of how promising the future of AI really is,” Kurniawati says. “Interestingly, our methods have also been applied outside of robotics, such as helping identify vulnerabilities in computer networks.”", "\n\n", "In 2021, Kurniawati and her associates were recognised for their contribution to the field of robotics with the prestigious ", "Robotics Science and Systems Test of Time award", ".", "\n\n", "It is only given after at least 10 years has passed since the research was first published and this is just the second time anyone has received the award.", "\n\n", "Professor Kurniawati and her team at the ANU College of Engineering, Computing and Cybernetics (CECC) were also awarded ", "two major grants by the Australian Research Council (ARC) in 2021", ".", "\n\n", "The ARC projects saw Kurniawati work to form the ", "Australian Robotic and Asset Management (ARIAM) Hub", " together with ", "USyd ACFR", "(lead of ARIAM Hub), ", "QUT Centre for Robotics", ", and ten industry partners on intelligent robots that help safely monitor and maintain  bridges, buildings, offshore oil rigs, and other complex structures; and with ", "Safran", " Electronics and Defense Australasia Pty Ltd on an AI-based co-pilot for helicopter rescue missions.", "\n\n", "Origin stories", "\n\n", "Kurniawati grew up in Indonesia where she was a fan of the earless robotic cat, ", "Doraemon", ", from a Japanese ", "manga", " series, as well as the robots from Star Wars films. She earned her undergraduate degree in Computer Science from the ", "University of Indonesia", " in 2001.", "\n\n", "During her doctoral work at NUS, Kurniawati did an internship at INRIA — France’s National Institute for Research in Digital Science and Technology — and then worked in Singapore and the United States as a Research Scientist at the ", "Singapore-MIT Alliance for Research and Technology, MIT", " before coming to Australia to join the ", "School of ITEE, University of Queensland (UQ", ") in 2012.", "\n\n", "Kurniawati was recruited to ANU in 2019 when ", "Senior Professor Thiébaux", " asked if she’d be interested in the Computer Science Futures Fellow position.", "\n\n", "“It looked like a good opportunity, and so I applied,” Kurniawati said.", "\n\n", "Once Kurniawati had accepted a position, the School of Computing nominated her for the ANU Futures Fellowship as well. The two fellowships enabled Kurniawati to set up her robotics lab and maintain a staff, which she said was “vital for the fundamental research I do and for starting a fruitful industry engagement”.", "\n\n", "Kurniawati is now an Australian citizen but still misses Indonesian food. She is always on the lookout for new Indonesian restaurants in Canberra.", "\n\n", "Educating the next generation", "\n\n", "Kurniawati said she enjoys teaching at ANU. “It keeps you young,” she said with a grin, adding that her students “ask questions that you might not have thought about before”.", "\n\n", "As a Professor with the ANU School of Computing, Kurniawati supervises research students. She said that teaching has kept her in direct contact with a valuable talent pool.", "\n\n", "“Some of my PhD students were my Honors year students. Once they finish their PhD, some of them might want to continue for a little bit longer as a postdoc with my group before launching their own respective careers,” she said, charting a course for her protégés that she herself took not long ago.", "\n\n", "——", "\n\n", "See Profesor Hanna Kurniawati’s full biography", "\n\n", "More about Professor Kurniawati’s research: ", "AI co-pilots to make air rescue faster, safer", "\n\n\n      \n      \n        \n\n\n\n\n\n  ", "\n    \n      \n      \n        ", "Newer", "\n      \n      \n        ", "Older", "\n      \n    \n  ", "\n\n\n      \n    "], "date": ["Congratulations to The Australian National University (ANU) expert Professor Hanna Kurniawati, who has been appointed as the ", " Professorial Chair for System Autonomy, Intelligence, and Decision Making."], "venue": ["SmartSat is Australia’s leading space research centre – where a team of Australia’s top researchers come together to spearhead the development of next generation space technologies."]},
{"title": ["Secret Agents: The Real and Imagined Inner Lives of Interactive Robots"], "description": ["\n      ", "Time: 10:00am-11:00pm, Tuesday 25 July 2023", "\n\n", "Location: Innovation Space, Level 2, ", "Birch Building 35", "\n\n", "Abstract", "\n\n", "Robots are Secret Agents. By this I mean that while computer scientists and roboticists may not view their robots as being fully autonomous, interactive, and adaptive, everyday users perceive them as such nonetheless. This creates a whole host of user expectations that may be hard to live up to – and that may cause problems when violated. In this talk, I’ll begin by explaining how robot design choices impact how people perceive robots and expect them to behave. I’ll then explain why robots are not simply agents, but are also moral and social agents, and explain the work the MIRRORLab has been doing to understand and address the unique perceptions and expectations that come along with these more nuanced types of agency. Finally, I’ll discuss how these two types of agency interact, and the unique challenges that this imposes.", "\n\n", "Biography", "\n\n", "Tom Williams is an Associate Professor of Computer Science at the Colorado School of Mines, where he directs the Mines Interactive Robotics Research Lab. Prior to joining Mines, Tom earned a joint PhD in Computer Science and Cognitive Science from Tufts University in 2017. Tom’s research focuses on enabling and understanding natural language based human-robot interaction that is sensitive to environmental, cognitive, social, and moral context. His work is funded by grants from the United States’ National Science Foundation, Office of Naval Research, and Army Research Lab,  as well as Early Career awards from NSF, NASA, and the Air Force Office of Scientific Research.", "\n\n\n      \n      \n        \n\n\n\n\n\n  ", "\n    \n      \n      \n      \n        ", "Older", "\n      \n    \n  ", "\n\n\n      \n    "], "date": ["Time: 10:00am-11:00pm, Tuesday 25 July 2023"], "venue": ["Location: Innovation Space, Level 2, "]},
{"title": ["How cloud computing has changed research and collaborations"], "description": ["\n      ", "Time: 1:30pm-3pm, Tuesday 6 June 2023", "\n\n", "Location: Innovation Space, Level 2, ", "Birch Building 35", "\n\n", "Abstract", "\n\n", "Cloud computing has had a transformative effect on many sectors and research has been no exception. The transformational bioinformatics group at CSIRO has been one of the first research groups to adopt the “cloud-first” mindset, enjoying the subsequent benefits of scaling to bigger datasets and global reach by offering novel analysis algorithms as user-friendly webservices.", "\n\n", "Contributing to globally connected health research through automated deployment (Infrastructure-as-code) and linking in with other cloud-native offerings enables fundamentally new health solutions. Specifically, this talk outlines how we scale up machine learning methods to identify novel Alzheimer’s disease genes in the world’s largest dataset, enable DNA queries in population-scale cohorts with quintillion data-points in real time, and track emerging strains of COVID-19 across distributed data sources to stay ahead of the pandemic.", "\n\n", "Biography", "\n\n", "Dr Denis Bauer is a government research scientist, adjunct professor at Macquarie University and an AWS Hero. Her unique approach of joining cloud-computing with deep biological domain knowledge translates research into impactful products that have been used for disease gene detection in Motor Neuron Disease and the COVID-19 vaccine development. She contributes to open-source software projects and advisory committees, as well as keynotes international IT and Medical conferences. She was recognized as Brilliant Women in Digital Health 2021 and Women in AI 2022. She has attracted more than $41M in funding to further life-science research and digital health.", "\n\n", "Twitter: ", "https://twitter.com/allPowerde", " ", "\n\n", "LinkedIN: ", "https://www.linkedin.com/in/denisbauer/", "\n\n\n      \n      \n        \n\n\n\n\n\n  ", "\n    \n      \n      \n        ", "Newer", "\n      \n      \n        ", "Older", "\n      \n    \n  ", "\n\n\n      \n    "], "date": ["Time: 1:30pm-3pm, Tuesday 6 June 2023"], "venue": ["Location: Innovation Space, Level 2, "]},
{"title": ["Transformative Innovations Recognized by World's Largest Computing Society"], "description": ["\n      ", "This is the first time that the ", "ACM Software System\nAward", " has been awarded to an\nAustralian-based team. The seL4 project represents two decades of\nsustained world-leading research. Since its original publication in\n2009, the seL4 kernel has set the bar for how secure systems should be\nengineered, while demolishing long-held beliefs about the limits of\nwhat formal methods can achieve, demonstrating that system security\nneed not come at the cost of performance. Today, seL4’s development is\noverseen by the seL4 Foundation. The kernel is deployed in several\ncommercial products and serves as the basis for a large body of\nongoing research.", "\n\n", "The winning team is led out of the University of New South Wales\n", "Trustworthy Systems Group", " by ", "ACM\nFellow and Scientia Professor Gernot\nHeiser", ", and\nalso includes ", "Associate Professor Michael\nNorrish", " from the ANU. Other members of the winning team\nare: ", "Gerwin Klein, Proofcraft", ";\nHarvey Tuch, Google; ", "Kevin\nElphinstone", ",\nUniversity of New South Wales; ", "June Andronick,\nProofcraft", "; ", "David Cock, ETH\nZurich", "; Philip Derrin, Qualcomm;\n", "Dhammika Elkaduwe, University of\nPeradeniya", ";\nKai Engelhardt; ", "Toby Murray, University of\nMelbourne", "; ", "Rafal Kolanski,\nProofcraft", "; ", "Thomas Sewell,\nUniversity of Cambridge", "; and\n", "Simon Winwood, Galois", ".", "\n\n\n      \n      \n        \n\n\n\n\n\n  ", "\n    \n      \n      \n        ", "Newer", "\n      \n      \n        ", "Older", "\n      \n    \n  ", "\n\n\n      \n    "], "date": ["This is the first time that the ", " has been awarded to an\nAustralian-based team. The seL4 project represents two decades of\nsustained world-leading research. Since its original publication in\n2009, the seL4 kernel has set the bar for how secure systems should be\nengineered, while demolishing long-held beliefs about the limits of\nwhat formal methods can achieve, demonstrating that system security\nneed not come at the cost of performance. Today, seL4’s development is\noverseen by the seL4 Foundation. The kernel is deployed in several\ncommercial products and serves as the basis for a large body of\nongoing research."], "venue": ["The winning team is led out of the University of New South Wales\n", " by ", ", and\nalso includes ", " from the ANU. Other members of the winning team\nare: ", ";\nHarvey Tuch, Google; ", ",\nUniversity of New South Wales; ", "; ", "; Philip Derrin, Qualcomm;\n", ";\nKai Engelhardt; ", "; ", "; ", "; and\n", "."]},
{"title": ["Software needs Watchdogs"], "description": ["\n      ", "Time: 3-4pm, Friday 17 March 2023", "\n\n", "Location: Innovation Space, Level 2, ", "Birch Building 35", "\n\n", "Abstract", "\n\n", "We advocate the increased real-time monitoring of software by\nsoftware. Only third-party monitors increase the trust in the\nmonitored software, and only low-overhead monitors are widely\nacceptable. These restrictions have technical\nconsequences. Third-party monitors cannot instrument the monitored\nsource code. Low-overhead monitors must be best-effort so not to slow\ndown the monitored software. We build a theoretical framework and\ncorresponding middleware for the online black-box monitoring of\nquantitative software properties, such as average or maximal response\ntime of a server, or algorithmic fairness in decision making. Unlike\nstatic verification, which answers reachability queries for programs,\nmonitoring is runtime verification, which answers membership queries\nfor observed program behaviors with regard to a given formal\nspecification. Our monitors are not necessarily finite-state, and\ntheir verdicts may be approximate or probabilistic. This allows for a\nrich spectrum of cost-precision-confidence trade-offs in monitoring.", "\n\n", "Biography", "\n\n", "Tom Henzinger is Professor at the ", "Institute of Science and Technology\nAustria", " (ISTA). He holds a Ph.D. degree in\nComputer Science from Stanford University (1991). He was Assistant\nProfessor of Computer Science at Cornell University, Professor of\nElectrical Engineering and Computer Sciences at the University of\nCalifornia, Berkeley, Director at the ", "Max-Planck Institute for\nComputer Science in Saarbrücken", ",\nGermany, and Professor of Computer and Communication Sciences at EPFL\nin Lausanne, Switzerland. From 2009 until 2022, he was the founding\npresident of ISTA in Klosterneuburg, Austria. His research focuses on\nthe theory of software systems, especially models, algorithms, and\ntools for the design and verification of reliable software\nsystems. His HyTech tool was the first model checker for mixed\ndiscrete-continuous systems. He is a member of the US National Academy\nof Sciences, Academia Europaea, the German Academy of Sciences\n(Leopoldina), and the Austrian Academy of Sciences. He is a Fellow of\nthe AAAS, the ACM, and the IEEE. He received the Robin Milner Award of\nthe Royal Society, the EATCS Award of the European Association for\nTheoretical Computer Science, and the Wittgenstein Award of the\nAustrian Science Fund.", "\n\n\n      \n      \n        \n\n\n\n\n\n  ", "\n    \n      \n      \n        ", "Newer", "\n      \n      \n        ", "Older", "\n      \n    \n  ", "\n\n\n      \n    "], "date": ["Time: 3-4pm, Friday 17 March 2023"], "venue": ["Location: Innovation Space, Level 2, "]},
{"title": ["Director's Seminar Series - Professor Seth Masters (WEHI)"], "description": ["New mutations causing type I IFN mediated disease", "\n", " ", "\n", "Host : Professor Si Ming Man", "\n", " ", "\n", "Abstract", "\n", "There are several innate immune pathways which can drive the production of type I IFN production and antiviral defence, which are also important for tumor surveillance and immunotherapy. Unfortunately, de novo or inherited mutations can also arise in genes of these pathways to cause interferonopathies, a class of diseases due to overactivation of type I IFN. Here we present several new mutations, all unpublished, that cause different interferonopathies. One of these is a new mutation in the pathway controlling linear ubiquitination (LUBAC), for which proteins such as HOIL, HOIP and in this case OTULIN are all implicated in different syndromes. Another is a novel gene that regulates mitochondrial RNA, mutation of which leads to type I IFN activation via the innate immune sensor of dsRNA MDA5. Finally we document the first variants in human UNC93B1, which regulate TLR signalling, and drive childhood-onset lupus. Characterising these diseases and understanding the underlying pathways provides answers for the affected families and facilitates successful therapeutic intervention. Evidence in humans regarding these targets can also be harnessed to boost immunity and anti-cancer responses.", "\n", "Biography", "\n", "Professor Seth Masters is head of the Inflammasomes and Autoinflammatory Disease laboratory at The Walter and Eliza Hall Institute. He has uncovered the genetic basis for several autoinflammatory diseases and continues to manage the associated Australian Registry, AADRY. Mechanistically this work has defined the role of inflammasome sensors such as NLRP1 and NLRC4 in IBD, and the cGAS/STING pathway in ALS. Professor Masters is a scientific advisor for NRG Therapeutics and Odyssey Therapeutics, holds a joint appointment at the Guangzhou Women’s and Children’s Hospital (China), and is appointed as a Fellow of the Viertel Foundation, HHMI-Wellcome Trust and the NHMRC.", "\n"], "date": ["12pm, Friday 1 Sep 2023"], "venue": ["Finkel Lecture Theatre"]},
{"title": ["Director's Seminar Series - Professor James Beeson (Burnet Institute)"], "description": ["Insights into Mechanisms and Targets of Human Immunity to Malaria to Advance Vaccine Development", "\n", " ", "\n", "Host: Associate Professor Brendan McMorran", "\n", " ", "\n", "Summary", "\n", "Malaria remains a major cause of morbidity and mortality globally and despite encouraging reductions in the burden of malaria in the early 2000s, progress has stalled since 2015 and the malaria burden increased in 2020. Developing a highly protective and long-lasting malaria vaccine has been a long-term global health goal, but has proved extremely challenging to achieve. Using studies of naturally-acquired immunity and vaccine trials in malaria-endemic populations, we are defining mechanisms and targets of protective immunity and immune durability. We are using this knowledge to enable new strategies for generating potent, long-lasting, functional immunity against malaria.", "\n", "Biography", "\n", "James is a medical researcher and Public Health Physician (registered in Australia). He completed his medical degree at Monash University and subsequent Advanced Fellowship Training with the Royal Australasian College of Physicians.", "\n", "After completing a PhD in 2001, he worked in the field of global health for over 20 years with a focus on infectious diseases and maternal and child health. His work includes research and public health activities in East and Central Africa, South East Asia and Papua New Guinea.", "\n", "Currently, he leads Burnet’s Malaria Immunity and Vaccines Research Group and the Healthy Mothers Healthy Babies program of research and implementation activities on maternal and child health in Papua New Guinea. His work is aligned with relevant global goals set by the World Health Organization and the UN Sustainable Development Goals.", "\n"], "date": ["12pm, Friday 25 Aug 2023"], "venue": ["Finkel Lecture Theatre"]},
{"title": ["Director's Seminar Series - Associate Professor Jess Nithianantharajah"], "description": ["Synapse imbalance, cognitive dysfunction and neurodevelopmental disorders", "\n", "Host: Professor John Bekkers", "\n", "Abstract:", "\n", "Excitatory (glutamatergic) and inhibitory (GABAergic) synapses play a pivotal role in balancing excitation and inhibition within brain circuits, thus optimizing information processing and plasticity. Our recent research has focused on neuroligins, a family of postsynaptic cell-adhesion molecules crucial for orchestrating activity-dependent stabilization of excitatory and/or inhibitory synapses. Gene mutations in neuroligin genes disrupt signalling and plasticity, yet their impact on cognitive behaviour is less understood. I will discuss our work behaviourally dissecting distinct cognitive domains in mouse models with deletions in neuroligin genes (Nlgn 1-4). Our findings reveal neuroligins play differential roles in adaptive behaviour, decision making, and learning. Our approach contributes to advancing the measurement of cognitive constructs in preclinical rodent models, enabling deeper understandings into the neurobiological basis of transdiagnostic measures of cognitive dysfunction in neurodevelopmental disorders.", "\n", "Biography:", "\n", "Associate Professor Jess Nithianantharajah is Research Lead for the Mental Health Mission at the Florey Institute of Neuroscience and Mental Health, a One in Five McIver Research Fellow, and heads the Synapse Biology and Cognition Laboratory. She completed her doctorate in behavioural neuroscience at the University of Melbourne, then undertook postdoctoral training at the Howard Florey Institute, Wellcome Trust Sanger Institute, University of Cambridge, and University of Edinburgh before returning to Melbourne as an independent group leader at The Florey Institute. Her research interests lie in understanding the role of synaptic genes in cognition and disease.", "\n", " ", "\n"], "date": ["12pm, Friday 22 Sep 2023"], "venue": ["Finkel Lecture Theatre"]},
{"title": ["JCSMR Honours Information Evening"], "description": [], "date": ["4.30–5.30pm Thursday 24 Aug 2023"], "venue": ["The John Curtin School of Medical Research", "131 Garran Road |The Australian National University | Acton, ACT, 2601"]},
{"title": ["Director's Seminar Series - Professor Alpha Yap (University of Queensland)"], "description": ["Forces in life: mechanotransduction and tissue homeostasis", "\n", " ", "\n", "Host: Professor Steve Lee", "\n", " ", "\n", "Abstract", "\n", "Epithelia constitute many of the principal barriers in metazoan bodies and are also common sites for disease, notably cancer and inflammation. Yet, the incidence of epithelial disease is remarkably low, given their constant exposure to injurious agents. Therefore, epithelia must have ways to detect potential disturbances and deal with them. It is now apparent that one path for detection is through tissue mechanics and mechanosensing. Cells constantly exert contractile forces on their neighbours through their cell-cell junctions and possess mechanotransduction pathways at those junctions that detect changes in force. Importantly, altered contractility is a hallmark of many forms of cellular disturbance from apoptosis to transformation. Mechanosensing may then be an early-warning system that allows epithelia to detect, and respond to, homeostatic challenges. Conversely, defects in mechanotransduction may predispose epithelia to disease. I will discuss these ideas in the context of how epithelia use mechanotransduction for cell-cell communication.", "\n", "Biography", "\n", "Professor Alpha Yap is a 2023 ARC Laureate Fellow. His research seeks to elucidate tissue mechanobiology: understanding how mechanical forces control the behaviour of complex, multicellular tissues in health in disease. He and his lab have been instrumental in elucidating the cellular mechanisms that generate and sense mechanical forces in epithelia, and have identified how these can protect tissue integrity against cell death and cancerous transformation. In his research, he has promoted interdisciplinary collaboration between cell and developmental biologists, engineers, mathematicians and theoretical and experimental physicists. He also has Introduced new technologies to characterize tissue mechanics, including Bayesian Inversion Stress Microscopy and optical tension sensors and promoted the multidisciplinary training of students and post-doctoral researchers. He has led international conferences and the Australia and New Zealand Society for Cell Biology. Professor Alpha serves as editor for major international journals. He was Division Head at the Institute for Molecular Bioscience and is a Lifetime Fellow of the American Society for Cell Biology.", "\n"], "date": ["12pm, Friday 15 Sep 2023"], "venue": ["Finkel Lecture Theatre"]},
{"title": ["Director's Seminar Series - Professor Jonathan Crowston (University of Sydney)"], "description": ["Ageing lifestyle and neurorecovery in glaucoma", "\n", " ", "\n", "Host: Associate Professor Riccardo Natoli", "\n", " ", "\n", "Abstract", "\n", "Vision loss from glaucoma is traditionally regarded irreversible. We have countered this notion with data in the mouse eye suggesting that early loss of neuronal function can be reversible. We have found that the capacity for recovery is tightly linked to animal age but can be modified by pharmacologic and lifestyle in interventions. We will also demonstrate that short-term improvement in retinal ganglion cell function can occur in human glaucoma and that this may provide a biomarker for testing candidate neuroprotectants in clinical trial.", "\n", "Biography", "\n", "Professor Jonathan Crowston is Professor of Ophthalmology at the University of Sydney, Director of the Save Sight Institute, and Glaucoma Consultant at the Royal Prince Alfred Hospital. Previously he was the ophthalmologist and clinician-scientist appointed as Professor of Ophthalmology at Duke/NUS. He was also the senior Glaucoma Consultant at the Singapore National Eye Centre where he managed tertiary referral care for patients with glaucoma and related optic neuropathies as well as providing consultant general on-call cover. He previously served as Head of Ophthalmology at the University of Melbourne and Managing Director of the Centre for Eye Research Australia.", "\n"], "date": ["12pm, Friday 8 Sep 2023"], "venue": ["Finkel Lecture Theatre"]},
{"title": ["Special School Seminar Series - Dr. Eckhardt Petri, MHBA (Global Medical Affairs Lead Dengue (Non-endemic) and Zika Takeda Pharmaceuticals International AG | Switzerland)"], "description": ["Overview development of TAK-003 - Live-attenuated tetravalent dengue vaccine", "\n", " ", "\n", "Host : Professor Thomas Preiss & Professor Ian Cockburn", "\n", " ", "\n", "Biography", "\n", "Dr. Eckhardt Petri is a Senior Director Global Medical Affairs, currently responsible for Dengue (Non endemic markets) and for Zika. Before that, he has been the Global Medical Affairs Lead for a Norovirus Vaccine in development and leading the European/Canadian (EuCan) Medical Affairs activities for Takeda’s Vaccines Business Unit. He graduated a diploma in human biology from Philipps-University, Marburg in 1993. Thereafter, he took up residency at the Eberhard-Karls-University Tuebingen, where in 1997 he received a PhD in the field of immuno-oncology. Dr.Eckhardt also holds a Master of Health Business Administration (MHBA), received by the Friedrich-Alexander University in Erlangen-Nuremberg. Prior to joining Takeda, Dr. Eckhardt Petri worked the first third of his career as a product manager within biotech & diagnostics industry and thereafter served almost 18 years in Medical Affairs for Vaccines. During his career, he has been contributing to several new vaccine launches in Europe and in North America, as well as in the introduction of an adjuvanted influenza vaccine in the USA.", "\n", "He has been leading (sero-)epidemiological studies, e.g., for Tick-Borne Encephalitis and Japanese Encephalitis. Further to that, he has been involved in diverse health economics projects in the field of influenza vaccines. In one of his previous roles as a Regional Medical Affairs Head, Dr. Eckhardt has been responsible for establishing a Medical Affairs/Market Access organisation for a newly created vaccine company (Seqirus) in 2015-2017. In his previous positions, Dr. Eckhardt also has medically supported pandemic preparation projects, which included contract discussions with European and Asian Health ministries and supranational Public Health organisations.    ", "\n"], "date": ["3pm, Wednesday 30 Aug 2023"], "venue": ["Finkel Lecture Theatre"]},
{"title": ["SMP Seminar Series, Semester 2, Week 5"], "description": ["Presentation: “Balls, babies and bullying: Barriers to Career Progression for Women in the Australian Obstetrics and Gynaecological Profession”", "\n\n", "Presenter", ": Melanie Thomas is currently a PhD student in the School of Medicine and Psychology studying the social foundations of medicine. She is currently finishing her PhD part time, while also working in clinical practice as a GP Obstetrician in North East Arnhem Land. ", "\n\n", "Abstract", ": The profession of Obstetrics and gynaecology has a long history of male domination.  In recent decades, there’s an increasing number of women returning to the clinical field. Despite this, men make up most of the leadership positions in Australia. This study explores the experiences of women at different stages of their career within the field of obstetrics and gynaecology in Australia. Whilst being motivated by a passion for women’s health, there were three dominant discourses around women’s difficulty in progressing their careers. This includes the three main themes of masculine traits in the workplace, the potential for and actual experience of bearing children, as well as bullying and harassment. This presentation covers my PhD work reviewing the methodological approach as well as key findings. ", "\n\n", " "], "date": ["12pm, Thursday 24 Aug 2023"], "venue": ["Innovations Theatre, Anthony Low Building, 124 Eggleston Road (In-person attendance is strongly encouraged). ", "Zoom Link details: ", " |Meeting ID: 831 4276 5391|Password: 166247"]},
{"title": ["SMP HDR writing group"], "description": ["How is your writing going? Feel like you need to get away from your usual desk and find some motivational company?", "\n\n", "Join the combined Medicine and Psychology PhD candidates Group Writing Session for collegial chat and turning thoughts into text!", "\n\n", "Commencing: Thursday 27 July 2023, 3:00pm to 5:00pm", "\n\n", "Then: fortnightly from 1:00pm to 4:00 pm – okay to drop in and out as suits", "\n\n", "Where: Flexible Learning Space, Room 2.36, Building 54, Florey, ANU", "\n\n", "No booking required, just turn up.", "\n\n", "Questions? email ", "alysia.robertson@anu.edu.au", " (psychology) or ", "anne.davis@anu.edu.au", " (medicine)"], "date": ["3–5pm Thursday 27 Jul 2023", "1–4pm Thursday 10 Aug 2023", "1–4pm Thursday 24 Aug 2023", "1–4pm Thursday 7 Sep 2023", "1–4pm Thursday 21 Sep 2023", "1–4pm Thursday 5 Oct 2023", "1–4pm Thursday 19 Oct 2023", "1–4pm Thursday 2 Nov 2023", "1–4pm Thursday 16 Nov 2023", "1–4pm Thursday 30 Nov 2023"], "venue": ["Flexible Learning Space, Room 2.36,", "\n\tFlorey Building, 54 Mills Road, ANU"]}
]